In [2]:
# Importamos el módulo sqllite
import sqlite3
import numpy as np
import pandas as pd

In [2]:
# Realizamos la conexión

conn = sqlite3.connect("thebridge.db")

# Creamos el comando o cursor
cursor = conn.cursor()

# Creamos una tabla
cursor.execute(
    """
        CREATE TABLE IF NOT EXISTS estudiantes
        (
            nombre VARCHAR(100) NULL,
            edad INTEGER NULL,
            email VARCHAR(50) NULL,
            created_on DATE
        )
    """
)

# Guardamos los cambios haciendo un commit
conn.commit()

# Cerramos la conexión
conn.close()

# Insertar valores en una tabla

In [3]:
# Realizamos la conexión

conn = sqlite3.connect("thebridge.db")

# Creamos el comando o cursor
cursor = conn.cursor()

# Creamos una tabla
cursor.execute(
    """
        INSERT INTO estudiantes VALUES
        ("Lucas", 27, "lucas@email.com", "2022-01-01")
    """
)

# Guardamos los cambios haciendo un commit
conn.commit()

# Cerramos la conexión
conn.close()

# Consultas con SELECT

In [3]:
# Realizamos la conexión

conn = sqlite3.connect("thebridge.db")

# Creamos el comando o cursor
cursor = conn.cursor()

# Creamos una tabla
cursor.execute(
    """
        SELECT * FROM estudiantes
    """
)

# Mostramos el cursor
print(cursor)

# Recorremos el primer registro con el método fetchone
usuario = cursor.fetchone()
print(usuario)

# Cerramos la conexión
conn.close()

<sqlite3.Cursor object at 0x000001D3E1BB12D0>
('Lucas', 27, 'lucas@email.com', '2022-01-01')

# Insert multiple

In [21]:
# Realizamos la conexión

conn = sqlite3.connect("thebridge.db")

# Creamos el comando o cursor
cursor = conn.cursor()

# Creamos una lista de elementos
estudiantes = [
    ('Mario', 25, 'mario@ejemplo.com', '2022-01-01'),
    ('Mercedes', 19, 'marcedes@ejemplo.com', ''),
    ('Juan', None, 'juan@ejemplo.com', '2022-01-09'),
    ('Lucas', np.nan, 'juan@ejemplo.com', 'NULL')
]


cursor.executemany(
    """
        INSERT INTO estudiantes VALUES (?,?,?,?)
    """, estudiantes
)

# Guardamos los cambios haciendo un commit
conn.commit()

# Cerramos la conexión
conn.close()

# Consulta multiple

In [22]:
# Realizamos la conexión

conn = sqlite3.connect("thebridge.db")

# Creamos el comando o cursor
cursor = conn.cursor()

# Creamos una tabla
cursor.execute(
    """
        SELECT * FROM estudiantes
    """
)

# Mostramos el cursor
print(cursor)

# Recorremos el primer registro con el método fetchone
estudiantes = cursor.fetchall()
print(estudiantes)

<sqlite3.Cursor object at 0x000001D3E25B7CE0>
[('Lucas', 27, 'lucas@email.com', '2022-01-01'), ('Mario', 25, 'mario@ejemplo.com', '2022-01-01'), ('Mercedes', 19, 'marcedes@ejemplo.com', ''), ('Juan', None, 'juan@ejemplo.com', '2022-01-09'), ('Mario', 25, 'mario@ejemplo.com', '2022-01-01'), ('Mercedes', 19, 'marcedes@ejemplo.com', ''), ('Juan', None, 'juan@ejemplo.com', '2022-01-09'), ('Mario', 25, 'mario@ejemplo.com', '2022-01-01'), ('Mercedes', 19, 'marcedes@ejemplo.com', ''), ('Juan', None, 'juan@ejemplo.com', '2022-01-09'), ('Lucas', None, 'juan@ejemplo.com', ''), ('Mario', 25, 'mario@ejemplo.com', '2022-01-01'), ('Mercedes', 19, 'marcedes@ejemplo.com', ''), ('Juan', None, 'juan@ejemplo.com', '2022-01-09'), ('Lucas', None, 'juan@ejemplo.com', 'NULL')]

In [23]:
for estudiante in estudiantes:
    print(estudiante)
    print(type(estudiante))

('Lucas', 27, 'lucas@email.com', '2022-01-01')
<class 'tuple'>
('Mario', 25, 'mario@ejemplo.com', '2022-01-01')
<class 'tuple'>
('Mercedes', 19, 'marcedes@ejemplo.com', '')
<class 'tuple'>
('Juan', None, 'juan@ejemplo.com', '2022-01-09')
<class 'tuple'>
('Mario', 25, 'mario@ejemplo.com', '2022-01-01')
<class 'tuple'>
('Mercedes', 19, 'marcedes@ejemplo.com', '')
<class 'tuple'>
('Juan', None, 'juan@ejemplo.com', '2022-01-09')
<class 'tuple'>
('Mario', 25, 'mario@ejemplo.com', '2022-01-01')
<class 'tuple'>
('Mercedes', 19, 'marcedes@ejemplo.com', '')
<class 'tuple'>
('Juan', None, 'juan@ejemplo.com', '2022-01-09')
<class 'tuple'>
('Lucas', None, 'juan@ejemplo.com', '')
<class 'tuple'>
('Mario', 25, 'mario@ejemplo.com', '2022-01-01')
<class 'tuple'>
('Mercedes', 19, 'marcedes@ejemplo.com', '')
<class 'tuple'>
('Juan', None, 'juan@ejemplo.com', '2022-01-09')
<class 'tuple'>
('Lucas', None, 'juan@ejemplo.com', 'NULL')
<class 'tuple'>

In [24]:
# utilizamos pandas para realizar lo mismo pero para DataFrame
import pandas as pd
q = """

SELECT * 
FROM estudiantes;
"""

In [25]:
df_estudiante = pd.read_sql(sql=q, con=conn)
df_estudiante

      nombre  edad                 email  created_on
0      Lucas  27.0       lucas@email.com  2022-01-01
1      Mario  25.0     mario@ejemplo.com  2022-01-01
2   Mercedes  19.0  marcedes@ejemplo.com
3       Juan   NaN      juan@ejemplo.com  2022-01-09
4      Mario  25.0     mario@ejemplo.com  2022-01-01
5   Mercedes  19.0  marcedes@ejemplo.com
6       Juan   NaN      juan@ejemplo.com  2022-01-09
7      Mario  25.0     mario@ejemplo.com  2022-01-01
8   Mercedes  19.0  marcedes@ejemplo.com
9       Juan   NaN      juan@ejemplo.com  2022-01-09
10     Lucas   NaN      juan@ejemplo.com
11     Mario  25.0     mario@ejemplo.com  2022-01-01
12  Mercedes  19.0  marcedes@ejemplo.com
13      Juan   NaN      juan@ejemplo.com  2022-01-09
14     Lucas   NaN      juan@ejemplo.com        NULL

In [19]:
df_estudiante.isnull().sum()

nombre        0
edad          4
email         0
created_on    0
dtype: int64

In [20]:
df_estudiante.isna().sum()

nombre        0
edad          4
email         0
created_on    0
dtype: int64

In [ ]:
df_estudiante.to_sql()

In [49]:
for i, row in df_estudiante.iterrows():
    q = f"""UPDATE estudiantes SET nombre = '{row['nombre']}', edad = "{'"NULL"' if pd.isnull(row['edad'])
    else row['edad']}", email = '{row['email']}',
            created_on = "{'"NULL"' if pd.isnull(row['created_on']) else row['created_on']}"
            """
q = q.replace('"','')
print(q)

UPDATE estudiantes SET nombre = 'Lucas', edad = NULL, email = 'juan@ejemplo.com',
            created_on = NULL

In [48]:
# Realizamos la conexión
conn = sqlite3.connect("thebridge.db")

# Creamos el comando o cursor
cursor = conn.cursor()

# Creamos una tabla
cursor.execute(
    q
)

# Guardamos los cambios haciendo un commit
conn.commit()

# # Recorremos el primer registro con el método fetchone
# estudiantes = cursor.fetchall()
# print(estudiantes)